<?php

namespace Database\Seeders;

use App\Models\Area;
use App\Models\Prefecture;
use App\Models\SubArea;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class PrefectureSeeder extends Seeder
{
    private const PREFECTURES = [
        '北海道' => [
            '石狩・岩見沢・夕張' => [
                '深川',
                '岩見沢',
                '夕張',
                '江別',
                '日高',
                '石狩',
            ],
            '苫小牧・千歳・登別' => [
                '白老',
                '伊達',
                '千歳',
                '苫小牧',
                '登別',
                '室蘭',
            ],
            '稚内・留萌・道北' => [
                '稚内',
                '留萌',
            ],
            '小樽・ニセコ・洞爺湖' => [
                '積丹',
                '余市',
                '小樽',
                'ニセコ',
                '洞爺湖',
                '喜茂別',
            ],
            '北見・網走・紋別' => [
                '紋別',
                '美幌',
                '北見',
                '網走',
            ],
            '旭川・富良野・美瑛' => [
                '美瑛',
                '富良野',
                '士別',
                '旭川',
            ],
            '札幌' => [
                '豊平区',
                '北大周辺',
                'その他南区',
                'その他西区',
                '南郷',
                '大通',
                '山鼻',
                '厚別区',
                'すすきの',
                '札幌駅周辺',
                '清田区',
                'その他北区',
                '東区',
                '澄川',
                '琴似',
                '麻生・新琴似',
                '円山・盤渓周辺',
                '手稲区',
                '白石区',
                '東札幌',
            ],
            '函館・松前・道南' => [
                '八雲',
                '松前',
                '函館',
            ],
            '釧路・根室' => [
                '弟子屈',
                '根室',
                '釧路',
            ],
            '帯広・十勝' => [
                '帯広',
                '十勝',
            ]
        ],
        '青森県' => [
            '八戸・三沢・十和田' => [
                '八戸',
                '三沢',
                'おいらせ町・六戸町',
                '五戸町・南部町・三戸町',
                '十和田',
            ],
            '青森・東津軽' => [
                '青森市',
                '今別・外ケ浜',
                '浅虫温泉・平内町',
            ],
            '北五津軽・西津軽' => [
                '五所川原',
                'つがる・中泊',
                '深浦・鯵ヶ沢',
                '鶴田・板柳',
            ],
            '弘前・中津軽・南津軽' => [
                '平川・大鰐',
                '黒石',
                '弘前',
            ],
            '上北・下北' => [
                '下北半島',
                '七戸町・東北町',
                'むつ',
                '横浜・野辺地・六ヶ所',
            ]
        ],
        '岩手県' => [
            '久慈・二戸' => [
                '久慈',
                '二戸',
            ],
            '奥州・一関' => [
                '奥州',
                '一関',
            ],
            '花巻・北上・遠野' => [
                '北上',
                '遠野',
                '花巻'
            ],
            '盛岡・八幡平・雫石' => [
                '盛岡',
                '八幡平',
                '雫石',
                '紫波・矢巾',
            ],
            '宮古・岩泉' => [
                '岩泉・田野畑',
                '宮古',
            ],
            '釜石・大船渡' => [
                '釜石',
                '大船渡'
            ]
        ],
        '宮城県' => [
            '石巻・気仙沼' => [
                '気仙沼',
                '石巻',
            ],
            '仙台市' => [
                '若林区',
                '国分町',
                '太白区',
                '青葉区',
                '泉区',
                '宮城野区',
                '仙台駅東口周辺',
                '仙台駅西口・一番町',
            ],
            '名取・岩沼' => [
                '岩沼',
                '名取',
            ],
            '蔵王・白石・角田' => [
                '白石',
                '蔵王',
                '角田',
            ],
            '大崎・登米' => [
                '大崎市',
                '登米市',
            ],
            '松島・塩釜' => [
                '松島',
                '塩釜',
            ]
        ],
        '秋田県' => [
            '能代・大館・鹿角' => [
                '大館',
                '北秋田市',
                '鹿角・小坂',
                '能代・八峰・三種',
            ],
            '横手・湯沢' => [
                '横手',
                '湯沢',
            ],
            '由利本荘・にかほ' => [
                'にかほ',
                '由利本荘',
            ],
            '仙北・大仙' => [
                '田沢湖',
                '大仙市'
            ],
            '秋田・潟上・男鹿' => [
                '上小阿仁・五城目・八郎潟',
                '秋田市',
                '男鹿・大潟',
                '潟上市',
            ]
        ],
        '山形県' => [
            '新庄・最上' => [
                '金山・鮭川・戸沢',
                '新庄',
                '最上・舟形・大蔵,'
            ],
            '米沢・南陽・長井' => [
                '米沢',
                '南陽',
                '長井・飯豊・川西',
            ],
            '庄内' => [
                '鶴岡',
                '酒田',
            ],
            '山形・天童・寒河江・尾花沢' => [
                '寒河江・河北・大江町',
                '尾花沢・村山・大石田',
                '東根',
                '上山',
                '山形市',
            ]
        ],
        '福島県' => [
            '中通り' => [
                '郡山',
                '白河',
                '須賀川',
                ',福島市',
                '二本松',
            ],
            '会津' => [
                '南会津',
                '喜多方',
                '会津若松',
            ],
            '浜通り' => [
                '南相馬・相馬（相双地域）',
                'いわき',
            ]
        ],
        '茨城県' => [
            '土浦・つくば・県南地域' => [
                '阿見',
                'つくば',
                '石岡・かすみがうら',
                '土浦',
                '牛久・龍ヶ崎',
                '守谷',
            ],
            '日立・常陸大宮・県北地域' => [
                '常陸大宮',
                '北茨城・高萩',
                '大子',
                '常陸太田',
                '日立',
            ],
            '筑西・下妻・県西地域' => [
                '坂東・常総',
                '結城',
                '筑西',
                '古河',
                '桜川',
                '八千代',
            ],
            '水戸・ひたちなか・県央地域' => [
                '大洗',
                '東海村',
                '水戸',
                '那珂',
                '笠間',
                '茨城・小美玉',
                'ひたちなか',
            ],
            '鹿島・行方・鹿行地域' => [
                '潮来',
                '鹿嶋',
                '行方・鉾田',
                '神栖',
            ]
        ],
        '栃木県' => [
            '宇都宮・鹿沼・下野' => [
                '下野',
                '上三川',
                '宇都宮',
                '鹿沼',
                '壬生町',
            ],
            '日光' => [
                '日光',
                '鬼怒川',
            ],
            '大田原・那須塩原' => [
                '那須',
                '那須塩原',
                '大田原',
            ],
            '栃木・小山・佐野・足利' => [
                '佐野',
                '栃木市',
                '小山',
                '足利',
            ],
            '矢板・さくら・塩谷' => [
                '矢板',
                'さくら市',
                '塩谷町',
            ],
            '那珂川・真岡・益子' => [
                '那須烏山・芳賀・高根沢',
                '真岡',
                '那珂川町',
            ]
        ],
        '群馬県' => [
            '高崎・前橋' => [
                '前橋',
                '高崎',
            ],
            '藤岡・富岡・安中' => [
                '安中',
                '富岡',
                '藤岡',
            ],
            '草津・渋川・中之条' => [
                '草津',
                '渋川',
                '伊香保',
            ],
            '沼田・みなかみ' => [
                'みなかみ',
                '沼田',
            ],
            '伊勢崎・太田・館林・桐生' => [
                '桐生',
                '伊勢崎',
                '太田',
                '館林',
            ]
        ],
        '埼玉県' => [
            '上尾・久喜・鴻巣' => [
                '上尾',
                '久喜',
                '桶川',
                '蓮田',
                '羽生',
                '鴻巣',
                '加須',
                '北本',
                '幸手',
            ],
            '秩父・長瀞・小川' => [
                '小川',
                '秩父',
                '長瀞',
            ],
            '川越・ふじみ野・東松山' => [
                '川越',
                '新座',
                '鶴ヶ島',
                '坂戸',
                'ふじみ野',
                '朝霞',
                '和光市',
                '東松山',
                 '志木',
            ],
            'さいたま市' => [
                '与野本町',
                '大宮',
                'さいたま新都心',
                '東大宮',
            ],
            '春日部・越谷・草加' => [
                '越谷',
                '三郷',
                '八潮',
                '草加',
                '春日部',
            ],
            '所沢・飯能' => [
                '飯能',
                '入間',
                '狭山',
                '所沢',
                '日高',
            ],
            '浦和' => [
                '南浦和',
                '西浦和',
                '浦和',
                '北浦和',
                '東浦和',
                '武蔵浦和',
            ],
            '川口・蕨・戸田' => [
                '川口',
                '蕨',
                '戸田',
            ],
            '熊谷・深谷・本庄・行田' => [
                '本庄',
                '熊谷',
                '深谷',
                '行田',
            ]
        ],
        '千葉県' => [
            '八千代・佐倉' => [
                '佐倉',
                '四街道',
                '八千代',
            ],
            '香取・銚子・旭市' => [
                '旭市',
                '佐原',
                '銚子',
                '小見川・山田・栗源',
            ],
            '千葉市' => [
                '中央区',
                '若葉区・緑区',
                '幕張新都心',
                '稲毛区・花見川区',
                '美浜区',
            ],
            '柏・我孫子' => [
                '我孫子',
                '柏',
            ],
            '成田' => [
                '成田空港周辺',
                '神崎・大栄・下総',
                '成田駅周辺',
            ],
            '茂原' => [
                '茂原',
                '白子・長生',
                '一宮・睦沢',
                '長柄・長南',
            ],
            '君津・富津' => [
                '君津',
                '富津',
            ],
            '市原' => [
                '市原',
                '姉崎',
            ],
            '勝浦・いすみ' => [
                '御宿',
                '大多喜',
                'いすみ',
                '勝浦',
            ],
            '浦安・舞浜' => [
                '浦安',
                '舞浜',
            ],
            '船橋・習志野' => [
                '船橋',
                '習志野',
            ],
            '館山・南房総' => [
                '館山',
                '南房総',
            ],
            '木更津・袖ヶ浦' => [
                '木更津',
                '袖ヶ浦',
            ],
            '鎌ヶ谷・白井・印西' => [
                '栄町',
                '白井',
                '鎌ヶ谷',
                '印西',
            ],
            '八街・富里' => [
                '八街',
                '富里',
            ],
            '山武・匝瑳' => [
                '山武',
                '横芝光',
                '匝瑳',
            ],
            '松戸・市川' => [
                '市川',
                '松戸',
            ],
            '鴨川' => [
                '鴨川市',
                '太海浜',
            ],
            '東金・大網白里・九十九里' => [
                '大網白里',
                '九十九里',
                '東金市',
            ],
            '流山・野田' => [
                '流山',
                '野田',
            ]
        ],
        '東京都' => [
            '品川・浜松町・田町' => [
                '品川',
                '浜松町',
                '田町',
            ],
            '六本木・麻布・広尾' => [
                '広尾',
                '白金',
                '六本木',
                '麻布十番',
                '西麻布',
            ],
            '豊洲・お台場・湾岸' => [
                '晴海',
                '豊洲',
                'お台場',
                '有明',
            ],
            '銀座・新橋・築地' => [
                '月島',
                '汐留',
                '築地',
                '銀座',
                '新橋',
                '有楽町・日比谷',
            ],
            '板橋・成増・赤羽' => [
                '板橋',
                '赤羽',
                '成増',
                '十条・王子',
            ],
            '代々木上原・下北沢・成城学園前' => [
                '狛江',
                '下北沢',
                '成城学園前',
                '経堂',
                '代々木上原・代々木八幡',
            ],
            '西東京' => [
                '田無',
                '東村山',
                '清瀬・ひばりヶ丘',
            ],
            '上野・浅草・日暮里' => [
                '町屋',
                '日暮里',
                '南千住・三ノ輪',
                '上野',
                '押上',
                '浅草',
            ],
            '目黒・五反田' => [
                '目黒',
                '五反田',
                '武蔵小山',
                '戸越銀座',
            ],
            '練馬・江古田' => [
                '練馬',
                '江古田',
            ],
            '人形町・門前仲町・葛西' => [
                '葛西',
                '人形町',
                '船掘・瑞江',
                '門前仲町・清澄白河',
                '木場・東陽町',
                '茅場町・八丁堀',
            ],
            '大井町・大森・蒲田' => [
                '蒲田',
                '大森',
                '大井町',
                '池上',
                '羽田空港',
            ],
            '東京駅・丸の内・日本橋' => [
                '丸の内',
                '東京駅周辺・八重洲',
                '日本橋',
            ],
            '水道橋・飯田橋・神楽坂' => [
                '四ツ谷',
                '飯田橋・市ヶ谷',
                '水道橋',
                '神楽坂',
            ],
            '恵比寿・代官山・中目黒' => [
                '恵比寿',
                '中目黒',
                '代官山',
            ],
            '新大久保・高田馬場' => [
                '早稲田',
                '高田馬場',
                '目白',
                '新大久保',
            ],
            '笹塚・明大前・下高井戸' => [
                '明大前',
                '下高井戸',
                '永福町・浜田山・久我山',
                '初台',
                '千歳烏山',
                '笹塚・幡ヶ谷',
            ],
            '小金井・国分寺・国立' => [
                '国立',
                '国分寺',
                '小金井',
            ],
            '赤坂・永田町・虎ノ門' => [
                '赤坂',
                '虎ノ門',
                '永田町・麹町'
            ],
            '新宿' => [
                '新宿御苑',
                '西新宿',
                '新宿南口',
                '新宿三丁目',
                '代々木',
                '新宿東口・歌舞伎町',
                '新宿西口',
            ],
            '北千住・綾瀬・金町' => [
                '金町',
                '北千住',
                '綾瀬・亀有',
                '竹ノ塚・西新井',
            ],
            '三軒茶屋・二子玉川' => [
                '三軒茶屋',
                '駒沢・用賀',
                '二子玉川',
                '池尻大橋・三宿',
            ],
            '中野・高円寺' => [
                '野方・上石神井',
                '阿佐ヶ谷',
                '中野',
                '高円寺',
                '中野坂上・方南町',
            ],
            '学芸大学・自由が丘' => [
                '田園調布・旗の台',
                '自由が丘',
                '学芸大学',
            ],
            '吉祥寺・荻窪・三鷹' => [
                '三鷹',
                '吉祥寺',
                '荻窪・西荻窪',
            ],
            '錦糸町・浅草橋・新小岩' => [
                '両国',
                '浅草橋・蔵前',
                '錦糸町',
                '亀戸',
                '新小岩・小岩',
            ],
            '渋谷' => [
                '神泉',
                'センター街・公園通り',
                '道玄坂',
                '渋谷東口・宮益坂',
                '渋谷南口・桜丘周辺',
            ],
            '神田・秋葉原・御茶ノ水' => [
                '神田',
                '秋葉原',
                '御茶ノ水',
                '神保町',
            ],
            '立川・八王子・青梅' => [
                '福生',
                '立川',
                '青梅',
                '八王子',
            ],
            '多摩・町田' => [
                '稲城',
                '多摩センター',
                '町田',
            ],
            '巣鴨・駒込' => [
                '駒込',
                '大塚',
                '巣鴨',
            ],
            '池袋' => [
                '池袋西口',
                '池袋東口',
            ],
            '原宿・表参道・青山' => [
                '表参道',
                '原宿',
                '青山',
                '北参道・千駄ヶ谷',
            ],
            '伊豆諸島・小笠原諸島' => [
                '伊豆諸島',
                '小笠原諸島',
            ],
            '府中・調布' => [
                '府中',
                '調布',
            ]
        ],
        '神奈川県' => [
            '湘南' => [
                '二宮',
                '平塚',
                '鎌倉',
                '江ノ島',
                '茅ヶ崎',
                '大磯',
                '大船',
                '寒川',
                '藤沢',
                '辻堂',
            ],
            '保土ヶ谷区・旭区' => [
                '今宿',
                '二俣川',
                '天王町',
                '保土ヶ谷',
            ],
            '海老名・厚木' => [
                '大和',
                '綾瀬',
                '厚木',
                '本厚木',
                '海老名',
                '座間',
            ],
            '港北区' => [
                '日吉',
                '菊名',
                '綱島',
                '新横浜',
                '大倉山',
            ],
            '泉区・瀬谷区' => [
                '泉区',
                '瀬谷',
                '三ツ境',
            ],
            '小田原・箱根・真鶴' => [
                '箱根',
                '湯河原・真鶴',
                '小田原',
                '南足柄',
            ],
            '港南区・戸塚区・栄区' => [
                '上大岡',
                '栄区',
                '港南台',
                '戸塚',
            ],
            'みなとみらい・桜木町・関内' => [
                '桜木町',
                '元町・中華街',
                '関内',
                'みなとみらい',
                '本牧',
                '山手',
            ],
            '磯子区・金沢区' => [
                '金沢八景',
                'その他金沢区',
                '磯子',
                '八景島',
            ],
            '川崎' => [
                '川崎駅周辺',
                '新百合ヶ丘',
                '川崎区',
                '登戸',
                '溝の口',
                '武蔵小杉',
            ],
            '相模原' => [
                '愛川・清川',
                '相模原市',
            ],
            '横浜' => [
                '横浜西口周辺',
                '高島町',
                '横浜東口周辺',
            ],
            '神奈川区' => [
                '新子安',
                '白楽',
                '東神奈川',
                '大口',
            ],
            '緑区' => [
                '中山',
                '長津田',
                '十日市場',
                '鴨居',
            ],
            '南区' => [
                '井土ヶ谷',
                '蒔田',
                '弘明寺',
            ],
            '青葉区・都筑区' => [
                'たまプラーザ',
                '市が尾',
                'センター南',
                '青葉台',
            ],
            '三浦半島' => [
                '葉山',
                '逗子',
                '横須賀',
                '三浦',
                '久里浜',
            ],
            '鶴見区' => ['鶴見'],
            '伊勢原・秦野' => [
                '伊勢原',
                '秦野',
                '開成町',
                '松田・大井・中井',
            ],
        ],
        '新潟県' => [
            '阿賀野・五泉・加茂' => [
                '五泉',
                '阿賀野市',
                '加茂市',
            ],
            '湯沢・十日町・魚沼' => [
                '湯沢',
                '魚沼',
                '十日町',
                '南魚沼',
            ],
            '長岡・柏崎' => [
                '見附市',
                '柏崎',
                '長岡',
            ],
            '上越・糸魚川・妙高' => [
                '妙高',
                '糸魚川',
                '上越',
            ],
            '新潟市' => [
                '東区',
                '西区',
                '女池',
                '西蒲区',
                '江南区',
                '新潟駅周辺',
                '古町',
            ],
            '燕三条' => [
                '三条市',
                '燕市',
            ],
            '新発田・胎内' => [
                '新発田',
                '胎内',
            ],
            '佐渡' => ['佐渡'],
        ],
        '富山県' => [
            '砺波・南砺' => [
                '南砺',
                '砺波',
            ],
            '高岡・射水・氷見' => [
                '氷見',
                '射水',
                '高岡',
            ],
            '魚津・黒部・滑川' => [
                '滑川',
                '入善・朝日',
                '上市・立山',
                '魚津',
                '黒部',
            ],
            '富山市' => ['富山市'],
        ],
        '石川県' => [
            '七尾・かほく・輪島' => [
                '津幡',
                '羽咋',
                '能登',
                '輪島',
                '七尾',
                '志賀町',
                'かほく市'
            ],
            '小松・白山・加賀' => [
                '白山',
                '小松',
                '加賀',
            ],
            '金沢・野々市・内灘' => [
                '金沢',
                '野々市',
                '内灘',
            ],
        ],
        '福井県' => [
            '鯖江・武生・越前海岸' => [
                '武生',
                '鯖江',
                '越前町',
                '南越前・池田',
            ],
            '敦賀・美浜・若狭' => [
                '美浜',
                '若狭町',
                '敦賀',
            ],
            '小浜・高浜・おおい町' => [
                '高浜',
                '小浜',
                'おおい町',
            ],
            '勝山・大野・和泉' => [
                '大野',
                '勝山',
                '和泉',
            ],
            '坂井・あわら市' => [
                '坂井',
                '三国',
                'あわら',
            ],
            '福井・永平寺・美山' => [
                '永平寺',
                '福井市',
                '美山町',
            ],
        ],
        '山梨県' => [
            '甲府・甲斐' => [
                '甲府',
                '甲府昭和',
                '南甲府',
                '甲府東',
                '甲斐',
            ],
            '山梨・甲州・笛吹' => [
                '笛吹',
                '勝沼',
                '山梨市',
                '塩山',
                '石和',
            ],
            '大月・上野原' => [
                '都留',
                '上野原',
                '丹波山・小菅',
                '大月',
            ],
            '富士川・市川三郷' => [
                '富士川',
                '市川三郷',
            ],
            '富士河口湖・富士吉田' => [
                '河口湖',
                '忍野',
                '山中湖',
                '鳴沢・上九一色',
                '富士吉田',
            ],
            '南巨摩' => [
                '身延',
                '下部・中富',
                '南部',
                '早川',
            ],
            '南アルプス・中央市' => [
                '南アルプス',
                '中央市',
            ],
            '北杜・韮崎' => [
                '北杜',
                '韮崎',
                '小淵沢',
                '明野',
                '白州',
            ],
        ],
        '長野県' => [
            '上田・東信' => [
                '佐久',
                '軽井沢',
                '上田',
                '小諸',
            ],
            '松本・中信' => [
                '松本',
                '塩尻',
                '木曽',
                '麻績・筑北・生坂',
                '白馬',
                '池田・松川',
                '大町',
                '安曇野',
            ],
            '諏訪・南信' => [
                '岡谷',
                '伊那',
                '諏訪',
                '飯田',
                '駒ヶ根',
                '下諏訪',
                '茅野',
            ],
            '長野・北信' => [
                '千曲・坂城',
                '小布施',
                '須坂',
                '飯山',
                '信濃町',
                '長野市',
                '野沢温泉',
            ],
        ],
        '岐阜県' => [
            '西濃' => [
                '大垣',
                '安八・輪之内',
                '垂井',
                '養老',
                '海津',
                '池田・神戸',
                '揖斐川・大野',
                '関ヶ原',
            ],
            '東濃' => [
                '恵那',
                '瑞浪',
                '中津川',
                '多治見',
                '土岐',
            ],
            '飛騨高山' => [
                '白川郷',
                '下呂',
                '高山',
                '飛騨',
            ],
            '中濃' => [
                '美濃',
                '関',
                '御嵩・八百津・川辺',
                '七宗・白川',
                '郡上',
                '可児',
                '美濃加茂',
            ],
            '岐阜・各務原' => [
                '各務原',
                '羽島',
                '本巣',
                '岐阜市',
                '山県',
            ],
        ],
        '静岡県' => [
            '島田・牧之原・御前崎' => [
                '吉田',
                '御前崎',
                '榛原',
                '相良',
                '金谷',
                '川根・中川根・本川根',
                '島田',
            ],
            '富士・富士宮' => [
                '富士',
                '富士宮',
                '芝川町',
                '富士川町',
                '吉原',
            ],
            '清水・由比' => [
                '清水',
                '清水港・清水駅・ドリームプラザ',
                '由比',
                '三保・日本平',
                '蒲原',
            ],
            '焼津・藤枝' => [
                '藤枝',
                '大井川町',
                '岡部',
                '焼津',
            ],
            '伊豆長岡・修善寺・天城' => [
                '中伊豆',
                '伊豆長岡',
                '韮山',
                '大仁',
                '天城湯ヶ島',
                '修善寺',
            ],
            '静岡市' => [
                '静岡北部',
                '安倍川・用宗',
                '草薙',
                '賎機・山間部',
                '千代田・安東・唐瀬',
                '久能・大谷',
                '駅南・石田街道',
                '呉服町・街',
                '登呂・高松・大浜',
            ],
            '伊東' => [
                '川奈・富戸',
                '宇佐美',
                '伊東',
            ],
            '沼津' => [
                '原・片浜・駿河湾沼津SA',
                '沼津インター・ぐるめ街道',
                '沼津北口・沼津北',
                '大瀬崎・三津・静浦',
                '沼津南口・沼津港・沼津南',
            ],
            '御殿場・裾野' => [
                '裾野',
                '御殿場',
                '小山町',
            ],
            '掛川・菊川' => [
                '大東',
                '菊川',
                '掛川市',
                '浜岡',
                '大須賀',
                '掛川市街',
            ],
            '磐田・袋井' => [
                '袋井',
                '浅羽',
                '福田',
                '豊田・竜洋',
            ],
            '湖西・三ケ日・浜名湖' => [
                '湖西・新居',
                '細江',
                '雄踏・舞阪',
                '三ヶ日・引佐',
            ],
            '浜松' => [
                '志都呂・佐鳴・高塚',
                '市野・上島・浜松インター',
                '都田・フルーツパーク・気賀',
                '浜松南・市野',
                '浜松街中',
            ],
            '西伊豆・松崎' => [
                '松崎',
                '西伊豆町',
                '土肥',
                '戸田',
            ],
            '三島・駿東・田方' => [
                '函南',
                '清水町',
                '三島',
                '長泉',
            ],
            '浜北・天竜' => [
                '浜北',
                '天竜・龍山',
                '佐久間・春野・水窪',
            ],
            '下田・南伊豆' => [
                '白浜',
                '弓ケ浜',
                '下田市',
                '下田駅周辺',
                '南伊豆町',
            ],
            '東伊豆・河津' => [
                '熱川',
                '河津',
                '稲取',
            ],
            '熱海' => [
                '熱海',
                '網代',
            ],
            '磐田・袋井' => [
                '磐田',
                '森町・豊岡',
            ],
            '伊豆高原' => [
                '城ヶ崎',
                '伊豆高原',
            ]
        ],
        '愛知県' => [
            '春日井・一宮・小牧' => [
                '一宮',
                '岩倉',
                '犬山',
                '大口',
                '扶桑',
                '春日井',
                '小牧',
                '江南',
                '北名古屋',
            ],
            '緑区・中川区・南区・港区' => [
                '南区',
                '中川区',
                '緑区',
                '港区',
            ],
            '常滑・東海・南知多' => [
                '大府',
                '阿久比',
                '東海市',
                '南知多',
                '半田',
                '常滑',
                '知多',
            ],
            '岡崎・幸田' => [
                '岡崎',
                '幸田',
            ],
            '長久手・日進・尾張旭' => [
                '瀬戸',
                '豊明',
                '日進',
                '長久手',
                '東郷町',
                '尾張旭',
            ],
            '刈谷・安城・西尾' => [
                '知立',
                '西尾',
                '安城',
                '高浜',
                '刈谷',
                '碧南',
            ],
            '豊橋・蒲郡・豊川' => [
                '豊川',
                '新城',
                '豊橋',
                '蒲郡',
            ],
            '金山・大須・熱田区' => [
                '金山',
                '熱田区',
                '鶴舞',
                '大須・上前津',
            ],
            '稲沢・蟹江・弥富' => [
                'あま市',
                '弥富',
                '津島',
                '稲沢',
                '蟹江',
            ],
            '天白区・瑞穂区・昭和区' => [
                '天白区',
                '昭和区',
                '瑞穂区',
            ],
            '丸の内・市役所周辺' => [
                '丸の内・久屋大通',
                '名古屋市役所周辺',
            ],
            '藤が丘・千種・名東区' => [
                '名東区',
                '藤が丘',
                '千種',
                '本山',
            ],
            '西区・守山区・北区' => [
                '大曽根',
                '西区',
                '北区',
                '守山区',
            ],
            '新栄・東区' => [
                '名古屋市東区',
                '新栄',
            ],
            '栄・錦・伏見' => [
                '伏見',
                '栄',
                '錦',
            ],
            '豊田・みよし' => [
                'みよし',
                '豊田',
            ],
            '名古屋駅周辺' => [
                '中村区',
                '名古屋駅周辺',
            ],
        ],
        '三重県' => [
            '津・松阪' => [
                '松阪',
                '津',
            ],
            '四日市・鈴鹿・亀山' => [
                '菰野',
                'いなべ',
                '亀山',
                '桑名',
                '鈴鹿',
                '四日市',
            ],
            '伊賀・名張' => [
                '伊賀',
                '名張',
            ],
            '伊勢志摩' => [
                '伊勢',
                '志摩',
                '鳥羽',
            ],
            '尾鷲・熊野' => [
                '熊野',
                '尾鷲',
            ]
        ],
        '滋賀県' => [
            '草津・守山・栗東' => [
                '栗東',
                '草津',
                '守山',
            ],
            '甲賀・湖南' => [
                '湖南',
                '甲賀',
            ],
            '湖西' => ['高島'],

            '大津' => ['大津'],

            '湖北' => ['長浜'],

            '東近江・彦根・米原' => [
                '東近江',
                '彦根',
                '米原',
            ],
            '近江八幡・野洲' => [
                '近江八幡',
                '野洲',
            ],
        ],
        '京都府' => [
            '宇治' => [
                '宇治',
                '宇治田原',
            ],
            '左京区' => [
                '岡崎',
                '北白川',
                '銀閣寺',
                '大原',
                '一乗寺',
                '貴船',
                '鞍馬',
                '出町柳',
            ],
            '東山区・山科区' => [
                '東山',
                '祇園',
                '山科',
            ],
            '南区・伏見区' => [
                '深草',
                '吉祥院・西大路',
                '伏見',
            ],
            '京丹後・宮津・舞鶴' => [
                '京丹後',
                '舞鶴',
                '天橋立',
                '宮津',
            ],
            '亀岡・南丹' => [
                '南丹',
                '亀岡',
            ],
            '城陽・京田辺' => [
                '城陽',
                '京田辺',
            ],
            '西京区・右京区' => [
                '太秦',
                '桂',
                '嵐山',
            ],
            '二条城・御所周辺' => [
                '二条城',
                '御所・西陣',
            ],
            '福知山・綾部・京丹波' => [
                '京丹波',
                '綾部',
                '福知山',
            ],
            '向日・長岡京' => [
                '長岡京',
                '向日市',
            ],
            '四条大宮・西院' => [
                '四条大宮',
                '西院',
            ],
            '北区' => [
                '衣笠・紫野',
                '北山',
                '金閣寺',
            ],
            '京都駅周辺' => [
                '京都駅中央口周辺',
                '京都駅八条口周辺',
            ],
            '久御山・八幡' => [
                '久御山',
                '八幡',
            ],
            '河原町・木屋町・先斗町' => [
                '先斗町',
                '木屋町',
                '河原町',
            ],
            '四条烏丸・烏丸御池' => [
                '烏丸御池',
                '四条烏丸',
            ],
            '木津川・京都府南部' => [
                '和束・笠置・南山城',
                '木津川',
                '精華町',
            ],
        ],
        '大阪府' => [
            '西天満・南森・天満橋' => [
                '天満',
                '天満橋',
                '西天満',
                '天六',
                '南森町',
            ],
            '豊中・池田・高槻' => [
                '豊中',
                '箕面',
                '茨木',
                '吹田',
                '池田',
                '高槻',
            ],
            '泉南' => [
                '貝塚',
                '泉佐野',
                '岸和田',
            ],
            '阪南' => [
                '阪南',
                '岬町',
            ],
            '大阪ベイエリア' => [
                '住之江',
                '咲洲',
                '天保山',
                '舞洲',
                '大阪南港',
                'ユニバーサルシティ',
                '弁天町',
            ],
            '北河内・東大阪' => [
                '東大阪',
                '交野',
                '八尾',
                '柏原',
                '門真',
                '四條畷',
                '大東',
                '枚方',
                '寝屋川',
                '守口',
            ],
            '大阪市内北東部' => [
                '東淀川区',
                '都島区・旭区',
                '城東区・鶴見区',
                '東成区・生野区',
            ],
            '大阪市内南西部' => [
                '西九条・大阪ドーム',
                '西淀川区',
                '住吉区',
                '大正区',
                '西成区',
                '平野区・東住吉区',
            ],
            '淀屋橋・本町・北浜' => [
                '北浜',
                '本町',
                '肥後橋',
                '阿波座',
                '淀屋橋',
            ],
            '泉北' => [
                '和泉',
                '泉大津',
                '堺',
            ],
            '福島・野田' => [
                '福島',
                '野田',
            ],
            '梅田・北新地' => [
                '北新地',
                '茶屋町・中崎町',
                '梅田',
                '中津周辺',
            ],
            '天王寺・新世界' => [
                '天王寺',
                '新世界',
            ],
            '南河内' => [
                '富田林',
                '大阪狭山',
                '河内長野',
                '松原・藤井寺・羽曳野',
            ],
            '江坂・千里中央' => [
                '江坂',
                '千里中央',
            ],
            '新大阪・西中島・十三' => [
                '上新庄',
                '新大阪',
                '西中島',
                '十三',
            ],
            'なんば・心斎橋' => [
                '心斎橋',
                '道頓堀',
                '長堀橋',
                '桜川・大国町・今宮',
                '西長堀',
                '南船場',
                '堀江・四ツ橋',
                'アメリカ村',
                'なんば',
            ],
            '谷町・上本町・鶴橋' => [
                '谷町・谷町四丁目',
                '鶴橋',
                '上本町',
            ],
            '京橋・OBP' => [
                'OBP',
                '京橋',
                '森ノ宮',
            ],
        ],
        '兵庫県' => [
            '垂水区・西区・北区' => [
                '北区',
                '有馬温泉',
                '垂水',
                '西区',
            ],
            '淡路島' => [
                '洲本',
                '淡路',
                '南あわじ',
            ],
            '兵庫区・長田区・須磨区' => [
                '兵庫区',
                '長田',
                '須磨',
            ],
            '姫路・加古川・たつの' => [
                '加古川',
                '加西',
                '姫路',
                'たつの市',
                '太子',
                '小野',
                '相生',
                '福崎',
                '赤穂',
                '高砂',
            ],
            '神戸ベイエリア' => [
                '神戸駅・ハーバーランド周辺',
                '六甲アイランド',
                'ポートアイランド',
            ],
            '豊岡・朝来' => [
                '朝来・養父',
                '城崎',
                '豊岡・香美',
            ],
            '西宮・芦屋・尼崎' => [
                '尼崎',
                '芦屋',
                '西宮',
            ],
            '宝塚・伊丹・川西' => [
                '川西',
                '伊丹',
                '宝塚',
            ],
            '明石・三木・稲美' => [
                '明石',
                '稲美町',
                '三木',
            ],
            '灘・東灘' => [
                '東灘',
                '灘',
                '御影',
                '六甲',
            ],
            '三宮・元町' => [
                '元町・南京町',
                '三宮',
                '北野坂・新神戸周辺',
            ],
            '三田・篠山・西脇' => [
                '三田',
                '篠山',
                '西脇',
            ],
        ],
        '奈良県' => [
            '奈良南部' => [
                '吉野',
                '奈良南部',
                '五條',
            ],
            '奈良北部' => [
                '斑鳩',
                '大和郡山',
                '安堵・川西',
                '山添・月ヶ瀬・都祁村',
                '三郷',
                '天理',
                '生駒',
            ],
            '奈良中部' => [
                '桜井',
                '香芝',
                '広陵',
                '橿原',
                '王寺',
                '田原本町',
                '河合・三宅',
                '宇陀',
                '御所',
                '明日香',
                '大和高田',
                '上牧',
            ],
            '奈良市' => ['奈良市'],
        ],
        '和歌山県' => [
            '和歌山・岩出・紀の川' => [
                '紀の川',
                '岩出',
                '橋本',
                '和歌山市',
            ],
            '白浜・新宮' => [
                '新宮',
                '白浜・串本',
            ],
            '御坊・日高' => [
                '御坊',
                '日高',
            ],
            '海南・有田・紀美野' => [
                '海南',
                '有田川町',
                '紀美野町',
                '有田',
            ],
            '田辺・みなべ' => [
                'みなべ',
                '田辺',
            ],
        ],
        '鳥取県' => [
            '鳥取県西部' => [
                '大山・琴浦',
                '鳥取県西部',
                '米子',
            ],
            '鳥取県中部' => [
                '倉吉',
                '湯梨浜・三朝',
            ],
            '鳥取県東部' => [
                '八頭・若桜・智頭',
                '鳥取市',
            ],
        ],
        '島根県' => [
            '浜田・大田・江津' => [
                '大田',
                '江津',
                '浜田',
            ],
            '出雲' => [
                '安来',
                '雲南・奥出雲',
                '出雲',
                '松江',
            ],

            '益田・津和野・吉賀' => [
                '益田',
                '津和野・吉賀',
            ],

            '隠岐' => ['隠岐の島'],

        ],
        '岡山県' => [
            '新見・真庭' => [
                '真庭',
                '新見',
            ],
            '総社・井原・高梁' => [
                '総社',
                '高梁',
                '井原',
            ],
            '倉敷・笠岡' => [
                '倉敷',
                '笠岡',
            ],
            '備前・瀬戸内' => [
                '備前',
                '瀬戸内市',
            ],
            '津山・美作' => [
                '美作',
                '津山',
            ],
            '岡山・玉野' => [
                '岡山市',
                '玉野',
            ],
        ],
        '広島県' => [
            '廿日市・宮島' => [
                '廿日市',
                '宮島',
            ],
            '呉・東広島・竹原' => [
                '東広島',
                '竹原',
                '海田',
                '呉',
            ],
            '広島市' => [
                '安佐北・安佐南',
                '宇品',
                '横川',
                '八丁堀',
                '紙屋町',
                '五日市',
                '銀山町',
                '広島府中',
            ],
            '福山・尾道・三原' => [
                '世羅',
                '三原',
                '福山',
                '尾道',
            ],
            '三次・北広島・県北' => [
                '庄原',
                '北広島',
                '三次',
            ],
        ],
        '山口県' => [
            '岩国・柳井・光' => [
                '柳井',
                '光',
                '岩国',
            ],
            '下関・宇部・小野田' => [
                '下関',
                '小野田',
                '宇部',
            ],
            '山口・防府' => [
                '山口市',
                '防府',
            ],
            '萩・長門・美祢' => [
                '萩',
                '美祢',
                '長門',
            ],
            '周南・下松' => [
                '下松',
                '周南',
            ],
        ],
        '徳島県' => [
            '阿波・吉野川' => [
                '吉野川',
                '阿波',
            ],
            '徳島・鳴門・小松島' => [
                '小松島',
                '松茂・北島・藍住',
                '板野・上坂・石井',
                '鳴門',
                '徳島市',
                '神山・勝浦・上勝',
            ],
            '美馬・三好' => [
                '美馬・つるぎ町',
                '三好・東みよし',
            ],
            '阿南・徳島南部' => [
                '阿南',
                '美波・海陽・那賀',
            ],
        ],
        '香川県' => [
            '小豆島・直島' => [
                '小豆島',
                '直島',
            ],
            'さぬき・東かがわ' => [
                'さぬき',
                '東かがわ',
            ],
            '三豊・観音寺' => [
                '三豊',
                '観音寺',
            ],
            '丸亀・坂出・綾川' => [
                '綾川・まんのう',
                '多度津・善通寺・琴平',
                '丸亀',
                '坂出・宇多津',
            ],
            '高松・三木' => [
                '高松',
                '三木',
            ],
        ],
        '愛媛県' => [
            '松山・伊予・東温' => [
                '伊予',
                '松山',
                '東温',
                '砥部',
                '久万高原',
            ],
            '大洲・宇和島' => [
                '八幡浜',
                '宇和島・愛南',
                '大洲',
            ],
            '西条・今治・四国中央' => [
                '西条',
                '今治',
                '新居浜',
                '四国中央',
            ],
        ],
        '高知県' => [
            '高知市・土佐・高知中部' => [
                '土佐',
                '高知市',
                '高知中部',
                '南国',
                '香南',
            ],
            '安芸・高知東部' => [
                '高知東部',
                '安芸',
            ],
            '四万十・高知西部' => [
                '四万十',
                '高知西部',
            ],
        ],
        '福岡県' => [
            '北九州' => [
                '中間',
                '豊前',
                '小倉南区',
                '岡垣',
                '行橋',
                '八幡東区',
                '八幡西区・若松区',
                '門司',
                '小倉北区・戸畑区',
            ],
            '飯塚・宗像・筑豊' => [
                '久山',
                '新宮',
                '田川',
                '直方',
                '粕屋町',
                '福津・古賀',
                '飯塚',
                '宗像',
            ],
            '六本松・桜坂・大濠' => [
                '大濠',
                '六本松',
                '桜坂',
            ],
            '久留米・大牟田・筑後' => [
                '筑後',
                'うきは',
                '柳川',
                '朝倉',
                '大牟田',
                '久留米・小郡',
                '八女',
            ],
            '赤坂・薬院・平尾' => [
                '薬院',
                '赤坂',
                '長浜',
                '平尾',
            ],
            '福岡市南区' => [
                '高宮',
                'その他福岡市南区',
                '大橋',
            ],
            '中洲・春吉' => [
                '西中洲',
                '呉服町',
                '中洲',
                '春吉',
            ],
            '太宰府・春日・筑紫野' => [
                '那珂川',
                '大野城',
                '太宰府',
                '春日',
                '筑紫野',
            ],
            '博多駅周辺' => [
                '博多駅筑紫口',
                '博多駅博多口',
                '祇園',
                '住吉',
            ],
            '天神周辺' => [
                '大名',
                '警固',
                '天神駅周辺',
                '今泉',
            ],
            '糸島・姪浜・福岡市西区' => [
                '姪浜',
                '糸島',
                'その他福岡市西区',
            ],
            '西新・百道・福岡市早良区' => [
                '百道',
                '西新',
                '福岡PayPayドーム周辺',
                'その他福岡市早良区',
            ],
            '福岡市東区' => [
                '香椎',
                'その他福岡市東区',
                '箱崎',
            ],
            'その他博多区' => [
                '南福岡',
                '東比恵・福岡空港',
                '吉塚',
                '竹下',
            ],
            '城南区' => ['福岡市城南区'],
        ],
        '佐賀県' => [
            '唐津・伊万里・有田' => [
                '唐津',
                '呼子',
                '有田町',
                '伊万里',
            ],
            '佐賀・鳥栖' => [
                '鳥栖',
                '佐賀市',
                'みやき・神崎・吉野ヶ里',
            ],
            '武雄・嬉野・鹿島' => [
                '武雄',
                '嬉野',
                '鹿島',
                '多久・小城',
            ],
        ],
        '長崎県' => [
            '壱岐・対馬' => [
                '対馬',
                '壱岐',
            ],
            '長崎・諫早・大村' => [
                '諫早',
                '長崎市',
                '時津',
                '大村',
            ],
            '佐世保・波佐見・平戸' => [
                '佐世保',
                '平戸',
                '波佐見',
            ],
            '島原・雲仙' => [
                '島原',
                '雲仙',
            ],
            '五島' => ['五島・新上五島'],
        ],
        '熊本県' => [
            '八代・人吉・水俣' => [
                '人吉',
                '水俣・芦北・球磨',
                '八代',
            ],
            '熊本・宇土・宇城' => [
                '宇土',
                '宇城',
                '熊本市',
            ],
            '玉名・山鹿・菊池' => [
                '荒尾',
                '合志',
                '菊池',
                '山鹿',
                '玉名',
            ],
            '阿蘇' => [
                '小国町',
                '阿蘇',
                '南阿蘇',
            ],
            '天草' => [
                '天草',
                '上天草',
            ],
        ],
        '大分県' => [
            '中津・宇佐・日田' => [
                '宇佐',
                '中津',
                '日田',
            ],
            '大分・臼杵・佐伯' => [
                '竹田',
                '大分市',
                '臼杵',
            ],
            '国東半島' => [
                '豊後高田',
                '杵築',
            ],
            '湯布院・別府' => [
                '湯布院',
                '別府',
            ],
            '佐伯・津久見' => [
                '津久見',
                '佐伯',
            ],
        ],
        '宮崎県' => [
            '宮崎・東諸県郡' => [
                '宮崎市',
                '綾・国富',
            ],
            '都城・小林' => [
                '小林市',
                '都城',
            ],
            '日南・串間' => [
                '日南',
                '串間',
            ],
            '西都・児湯郡' => [
                '西都',
                '児湯郡',
            ],
            '延岡・日向・臼杵郡' => [
                '延岡',
                '臼杵',
                '日向市',
            ],
        ],
        '鹿児島県' => [
            '鹿児島・日置' => [
                '日置',
                '鹿児島市',
            ],
            '諸島列島' => [
                '種子島',
                '奄美',
                '屋久島',
            ],
            '枕崎・指宿' => [
                '指宿',
                '枕崎・南九州',
                '南さつま',
            ],
            '薩摩川内・出水' => [
                '出水',
                '薩摩川内',
                'さつま町',
                '阿久根',
            ],
            '大隅半島' => [
                '志布志',
                '鹿屋',
                '肝付・錦江・南大隅',
            ],
            '霧島・伊佐' => [
                '霧島',
                '伊佐・湧水',
            ],
        ],
        '沖縄県' => [
            '豊見城・本島南部' => [
                '糸満',
                '南城市',
                '南風原',
                '豊見城',
            ],
            '那覇' => [
                '首里',
                '松山・若狭・波の上',
                '国際通り',
                '小禄・那覇空港周辺',
                '那覇新都心',
                '識名・沖縄大周辺',
            ],
            '沖縄市・本島中部' => [
                '北中城',
                '沖縄市',
                '浦添',
                '読谷',
                '宜野湾',
                '西原',
                '恩納村',
                '北谷',
                'うるま市',
            ],
            '沖縄離島' => [
                '宮古島',
                '久米島',
                '石垣島',
            ],
            '名護・本島北部' => [
                '本部',
                '今帰仁',
                '名護',
                '宜野座・金武町',
            ],
        ],
    ];
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Prefecture::truncate();
        Area::truncate();
        SubArea::truncate();
        foreach (self::PREFECTURES as $prefectureName => $areas) {
            $prefecture = Prefecture::create([
                'name' => $prefectureName,
            ]);
            $this->createArea($prefecture, $areas);
        }
    }

    /**
     * createArea
     *
     * @param  Prefecture $prefecture
     * @param  array $areas
     * @return void
     */
    public function createArea(Prefecture $prefecture, array $areas): void
    {
        if (count($areas)) {
            foreach ($areas as $areaName => $subAreas) {
                $area = Area::create([
                    'name' => $areaName,
                    'prefecture_id' => $prefecture->id
                ]);
                $this->createSubArea($area, $subAreas);
            }
        }
    }

    /**
     * createSubArea
     *
     * @param  Area $area
     * @param  array $subAreas
     * @return void
     */
    public function createSubArea(Area $area, array $subAreas): void
    {
        if (count($subAreas)) {
            foreach ($subAreas as $subArea) {
                SubArea::create([
                    'name' => $subArea,
                    'area_id' => $area->id
                ]);
            }
        }
    }
}
